Autodesk.Revit.DB.Instance.GetTotalTransform
Gets the total transform, which includes the true north transform for instances like import instances.
Remarks:
For most of other instances, it simply returns the inherent transform.
Returns:
The calculated total transform.
Since:
2012

Autodesk.Revit.DB.Instance.GetTransform
Gets the transform of the instance.
Returns:
The inherent transform.
Since:
2012

Autodesk.Revit.DB.Instance
The base class for all instance objects.